Revit 2027 API
IFCPropertyMappingInfo Properties
The IFCPropertyMappingInfo type exposes the following members.
Properties
Name | Description
ExportFlag |  Whether or not the property is included in export.
IFCPropertyName |  The IFC property name.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
RevitPropertyId |  The Revit property id.
RevitPropertyName |  The Revit property name.
Top
See Also
Reference
IFCPropertyMappingInfo Class
Autodesk.Revit.DB Namespace